#
# .zsh_plugins.txt - antidote plugins file
#

#
# Init
#

mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/homebrew

#
# History
#

mattmc3/zephyr path:plugins/history
larkery/zsh-histdb pre:init_histdb

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

#
# Editor
#

mattmc3/zephyr path:plugins/editor
# jeffreytse/zsh-vi-mode
# sorin-ionescu/prezto path:modules/editor
# romkatv/zsh-no-ps2
$ZDOTDIR/lib/zsh-no-ps2.zsh

#
# Prompts
#

# Prompt is configured in conf.d/prompt.zsh (oh-my-posh only).

#
# Clipboard
#

ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile

#
# Misc
#

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/utility

#
# OMZ
#

ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
ohmyzsh/ohmyzsh path:plugins/bun
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/mise
ohmyzsh/ohmyzsh path:plugins/uv

# ohmyzsh/ohmyzsh path:plugins/docker-compose
# ohmyzsh/ohmyzsh path:plugins/magic-enter
# ohmyzsh/ohmyzsh path:plugins/docker
# ohmyzsh/ohmyzsh path:plugins/npm
# ohmyzsh/ohmyzsh path:plugins/python
# ohmyzsh/ohmyzsh path:plugins/ssh
# ohmyzsh/ohmyzsh path:plugins/sudo
# ohmyzsh/ohmyzsh path:plugins/vscode
# ohmyzsh/ohmyzsh path:plugins/ubuntu

#
# Utils
#

romkatv/zsh-bench kind:path
Aloxaf/fzf-tab
djui/alias-tips

#
# Final
#

zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search kind:defer
